{
  "backend/main.mo": "Actor providing user profiles, product and bundle data, orders, download tokens, invite status tracking, and Stripe configuration with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the root element and main client script.",
  "frontend/src/App.tsx": "Main React app routing configuration using TanStack Router with storefront and admin routes.",
  "frontend/src/components/account/PrincipalIdSection.tsx": "Component displaying the user's principal ID with copy-to-clipboard functionality.",
  "frontend/src/components/admin/FileUploadField.tsx": "Component handling file selection, byte conversion, upload progress, and emitting an ExternalBlob.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard that restricts admin pages based on authentication and admin role checks.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders a login/logout button using Internet Identity and handles authentication, logout, and error recovery.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to create a profile and submits profile data to the backend.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps protected content and shows a login prompt when the user is not authenticated.",
  "frontend/src/components/layout/StoreLayout.tsx": "Main store layout with navigation, categories, user/account links, admin access, mobile menu, and profile setup modal.",
  "frontend/src/components/store/CategoryNav.tsx": "Shows a list of category buttons linking to category pages.",
  "frontend/src/components/store/DownloadButton.tsx": "Provides a button to download a script file and handles file retrieval, errors, and UI state.",
  "frontend/src/components/store/InviteOnlyUsernameForm.tsx": "Form for submitting a TradingView username required for invite-only product access.",
  "frontend/src/components/store/ProductCard.tsx": "Displays product details including title, description, price, category, and special badges with a link to the product page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for fetching and updating user profiles and roles, plus checking admin status via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication via Internet Identity, managing identity state, login, logout, and context exposure.",
  "frontend/src/hooks/usePrincipalId.ts": "Returns the caller’s principal ID and whether they are authenticated.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating products, bundles, categories, and invite statuses via the backend actor.",
  "frontend/src/hooks/useStripeCheckout.ts": "Defines a mutation hook that creates Stripe checkout sessions using backend API calls.",
  "frontend/src/index.css": "Tailwind CSS setup with custom CSS variables for theming and base global styles.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminBundlesPage.tsx": "Admin UI for listing, creating, editing, and deleting bundles with form dialogs and product selection.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Displays all product categories with a notice explaining automatic category creation.",
  "frontend/src/pages/admin/AdminDashboardLayout.tsx": "Provides the layout and navigation for all admin dashboard pages with route guarding.",
  "frontend/src/pages/admin/AdminInviteRequestsPage.tsx": "Shows invite access requests and allows admins to update their statuses.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page explaining that order tracking is pending backend implementation.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for managing products, including creation, editing, deletion, and file uploads.",
  "frontend/src/pages/admin/AdminStripeSettingsPage.tsx": "Admin form for configuring Stripe secret key and allowed countries, with save handling and status alerts.",
  "frontend/src/pages/legal/DisclaimerPage.tsx": "Displays a disclaimer detailing trading risks, lack of guarantees, and user responsibility.",
  "frontend/src/pages/legal/PrivacyPolicyPage.tsx": "Shows a privacy policy covering data collection, usage, sharing, security, rights, and cookies.",
  "frontend/src/pages/legal/RefundPolicyPage.tsx": "Outlines the refund policy for digital products, including exceptions and request procedures.",
  "frontend/src/pages/legal/TermsPage.tsx": "Provides terms of service including licensing, IP rights, account rules, and liability limits.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return home.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Shows a payment success confirmation with navigation to purchases or home.",
  "frontend/src/pages/store/AccountPage.tsx": "Authenticated account settings page displaying the user’s Internet Identity principal ID.",
  "frontend/src/pages/store/BundleDetailPage.tsx": "Shows bundle details, included products, and handles purchase via Stripe checkout.",
  "frontend/src/pages/store/BundlesListingPage.tsx": "Lists all available bundles with summary info and navigation to detail pages.",
  "frontend/src/pages/store/CategoryListingPage.tsx": "Displays products for a selected category, handling loading and empty states.",
  "frontend/src/pages/store/HomePage.tsx": "Renders the store homepage with hero content, category navigation, featured products, and bundle previews.",
  "frontend/src/pages/store/ProductDetailPage.tsx": "Shows detailed product info with purchase flow via Stripe and handles loading or missing product states.",
  "frontend/src/pages/store/PurchasesPage.tsx": "Lists the authenticated user's purchase invite statuses with badges and details.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using query strings and session storage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes the project’s state, features, requirements, and architectural notes for the ecommerce system."
}