{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, products, bundles, orders, download tokens, invite statuses, and Stripe configuration with storage mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON structure.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "Base HTML page loading the React frontend entrypoint.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes for store, account, payments, and admin pages wrapped in StoreLayout and ThemeProvider.",
  "frontend/src/components/account/PrincipalIdSection.tsx": "Component displaying user's principal ID with copy-to-clipboard functionality and status messages.",
  "frontend/src/components/admin/FileUploadField.tsx": "Admin file upload component converting files to ExternalBlob with progress tracking.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Route guard blocking access to admin pages unless authenticated and admin, showing alerts otherwise.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to submit name and optional TradingView username, saving the profile via backend mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wraps content and displays a login prompt if the user is not authenticated.",
  "frontend/src/components/layout/StoreLayout.tsx": "Provides the main store layout with navigation, category links, admin controls, mobile menu, and includes the profile‑setup modal.",
  "frontend/src/components/store/CategoryNav.tsx": "Renders category buttons linking to category pages based on fetched categories.",
  "frontend/src/components/store/DownloadButton.tsx": "Handles downloading a product file as a .pine script with status and error toasts.",
  "frontend/src/components/store/InviteOnlyUsernameForm.tsx": "Collects and submits a TradingView username for invite‑only products with simple validation.",
  "frontend/src/components/store/ProductCard.tsx": "Displays a product summary card with title, price, category, and invite‑required badge.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useAuthz.ts": "Provides hooks for fetching and updating user profile, role, and admin status via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, loading and managing identities and login state.",
  "frontend/src/hooks/usePrincipalId.ts": "Derives authenticated state and principal ID from the Internet Identity context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for CRUD operations on products, bundles, categories, and invite statuses using the backend actor.",
  "frontend/src/hooks/useStripeCheckout.ts": "Defines a mutation hook to create Stripe checkout sessions via the backend and return the session URL.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom CSS variables for theming in light and dark modes.",
  "frontend/src/main.tsx": "Initializes the React root, sets up React Query, Internet Identity provider, and mounts the App component.",
  "frontend/src/pages/admin/AdminBundlesPage.tsx": "Renders bundle management UI with create, edit, and delete actions using related query hooks.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Displays product categories retrieved from the backend with simple loading and empty states.",
  "frontend/src/pages/admin/AdminDashboardLayout.tsx": "Provides the admin dashboard layout with navigation and protected routing for admin pages.",
  "frontend/src/pages/admin/AdminInviteRequestsPage.tsx": "Shows invite request records and allows admins to update invite status via a dropdown.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Placeholder page informing that order tracking will be available once backend support is implemented.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Implements product management UI with support for creating, editing, and deleting products, including file uploads.",
  "frontend/src/pages/admin/AdminStripeSettingsPage.tsx": "UI for admins to configure Stripe secret key and allowed countries, with form handling and save notifications.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface to assign user roles by principal ID with validation and role selection.",
  "frontend/src/pages/legal/DisclaimerPage.tsx": "Static page displaying a financial and liability disclaimer for the platform.",
  "frontend/src/pages/legal/PrivacyPolicyPage.tsx": "Static privacy policy outlining data collection, usage, sharing, and user rights.",
  "frontend/src/pages/legal/RefundPolicyPage.tsx": "Static refund policy describing conditions and process for refund requests on digital products.",
  "frontend/src/pages/legal/TermsPage.tsx": "Static terms of service describing usage rules, obligations, and legal limitations.",
  "frontend/src/pages/payments/PaymentFailurePage.tsx": "Displays a message for cancelled or failed payments with options to retry or return home.",
  "frontend/src/pages/payments/PaymentSuccessPage.tsx": "Shows payment confirmation and links to purchases or continued shopping.",
  "frontend/src/pages/store/AccountPage.tsx": "Authenticated account settings page showing the user's Internet Identity principal ID.",
  "frontend/src/pages/store/BundleDetailPage.tsx": "Displays detailed info for a bundle, including included products and a Stripe checkout flow.",
  "frontend/src/pages/store/BundlesListingPage.tsx": "Lists all bundles with names, descriptions, prices, and navigation to each bundle's detail page.",
  "frontend/src/pages/store/CategoryListingPage.tsx": "Shows products within a selected category using ProductCard components.",
  "frontend/src/pages/store/HomePage.tsx": "Provides the storefront homepage with hero section, categories, featured products, and bundle previews.",
  "frontend/src/pages/store/ProductDetailPage.tsx": "Displays product details, instructions, and allows initiating a Stripe checkout for purchase.",
  "frontend/src/pages/store/PurchasesPage.tsx": "Shows the user's purchased products and invite statuses within an authenticated page.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the ecommerce site's purpose, architecture notes, and a list of implemented features with IDs, versions, and requirements."
}