{
  "kind": "build_request",
  "title": "Show Internet Identity Principal ID in user profile/account area",
  "projectName": "ScriptScope Market",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Add an authenticated user-facing profile/account area that displays the currently logged-in Internet Identity Principal ID as copyable text (e.g., a “Your Principal ID” section) so users can paste it when requesting admin access.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "i dont see it can you display in profile",
          "ok do it"
        ]
      },
      "acceptanceCriteria": [
        "When a user is logged in, the UI shows a labeled field containing the user’s Principal ID in its standard textual format (e.g., aaaaa-bbbbb-...).",
        "A “Copy” action copies the Principal ID to the clipboard and provides a visible confirmation (toast or inline message).",
        "If the user is not logged in, the account/profile area is not shown and the user is prompted to log in (using the existing login flow)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Expose a clear navigation path to the new/existing profile/account area from the storefront header/navigation so users can reliably find their Principal ID after signing in.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "display in profile"
        ]
      },
      "acceptanceCriteria": [
        "From the main storefront navigation, an authenticated user can reach the profile/account area in 1 click.",
        "The navigation element is not shown (or is disabled) when the user is not authenticated."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure the Principal ID display is derived directly from the active Internet Identity session (the current identity) and updates correctly after login/logout without requiring a full page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-20"
        ],
        "quotes": [
          "i dont see it can you display in profile"
        ]
      },
      "acceptanceCriteria": [
        "After logging in, the Principal ID appears without a manual refresh.",
        "After logging out, the Principal ID is no longer visible and the UI returns to the logged-out state.",
        "Switching identities (logout/login) results in the displayed Principal ID changing accordingly."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts or other paths listed in frontend.immutablePaths; compose new UI/components and routes around the existing auth hooks.",
    "Do not change the backend authorization/admin model as part of this request; this change is UI-only for displaying/copying the Principal ID."
  ],
  "nonGoals": [
    "Automatically granting admin access based on email address or displaying any email-based identifier for admin access.",
    "Changing the existing admin role assignment flow or bypassing Access Denied checks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}